bench/results/50000_redis.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: bench/rank_ab.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 1m5s max duration (incl. graceful stop):
              * rank_ab: 30 looping VUs for 1m0s (gracefulStop: 5s)


running (0m01.0s), 30/30 VUs, 3027 complete and 0 interrupted iterations
rank_ab   [   2% ] 30 VUs  0m01.0s/1m0s

running (0m02.0s), 30/30 VUs, 5220 complete and 0 interrupted iterations
rank_ab   [   3% ] 30 VUs  0m02.0s/1m0s

running (0m03.0s), 30/30 VUs, 9210 complete and 0 interrupted iterations
rank_ab   [   5% ] 30 VUs  0m03.0s/1m0s

running (0m04.0s), 30/30 VUs, 12223 complete and 0 interrupted iterations
rank_ab   [   7% ] 30 VUs  0m04.0s/1m0s

running (0m05.0s), 30/30 VUs, 15574 complete and 0 interrupted iterations
rank_ab   [   8% ] 30 VUs  0m05.0s/1m0s

running (0m06.0s), 30/30 VUs, 19887 complete and 0 interrupted iterations
rank_ab   [  10% ] 30 VUs  0m06.0s/1m0s

running (0m07.0s), 30/30 VUs, 24515 complete and 0 interrupted iterations
rank_ab   [  12% ] 30 VUs  0m07.0s/1m0s

running (0m08.0s), 30/30 VUs, 27806 complete and 0 interrupted iterations
rank_ab   [  13% ] 30 VUs  0m08.0s/1m0s

running (0m09.0s), 30/30 VUs, 31134 complete and 0 interrupted iterations
rank_ab   [  15% ] 30 VUs  0m09.0s/1m0s

running (0m10.0s), 30/30 VUs, 35821 complete and 0 interrupted iterations
rank_ab   [  17% ] 30 VUs  0m10.0s/1m0s

running (0m11.0s), 30/30 VUs, 38037 complete and 0 interrupted iterations
rank_ab   [  18% ] 30 VUs  0m11.0s/1m0s
time="2026-08-01T21:44:21+09:00" level=warning msg="The test has generated metrics with 100477 unique time series, which is higher than the suggested limit of 100000 and could cause high memory usage. Consider not using high-cardinality values like unique IDs as metric tags or, if you need them in the URL, use the name metric tag or URL grouping. See https://grafana.com/docs/k6/latest/using-k6/tags-and-groups/ for details." component=metrics-engine-ingester

running (0m12.0s), 30/30 VUs, 42273 complete and 0 interrupted iterations
rank_ab   [  20% ] 30 VUs  0m12.0s/1m0s

running (0m13.0s), 30/30 VUs, 48101 complete and 0 interrupted iterations
rank_ab   [  22% ] 30 VUs  0m13.0s/1m0s

running (0m14.0s), 30/30 VUs, 54318 complete and 0 interrupted iterations
rank_ab   [  23% ] 30 VUs  0m14.0s/1m0s

running (0m15.0s), 30/30 VUs, 60482 complete and 0 interrupted iterations
rank_ab   [  25% ] 30 VUs  0m15.0s/1m0s

running (0m16.0s), 30/30 VUs, 64916 complete and 0 interrupted iterations
rank_ab   [  27% ] 30 VUs  0m16.0s/1m0s

running (0m17.0s), 30/30 VUs, 71630 complete and 0 interrupted iterations
rank_ab   [  28% ] 30 VUs  0m17.0s/1m0s

running (0m18.0s), 30/30 VUs, 78830 complete and 0 interrupted iterations
rank_ab   [  30% ] 30 VUs  0m18.0s/1m0s

running (0m19.0s), 30/30 VUs, 87002 complete and 0 interrupted iterations
rank_ab   [  32% ] 30 VUs  0m19.0s/1m0s

running (0m20.0s), 30/30 VUs, 94165 complete and 0 interrupted iterations
rank_ab   [  33% ] 30 VUs  0m20.0s/1m0s
time="2026-08-01T21:44:29+09:00" level=warning msg="The test has generated metrics with 200008 unique time series, which is higher than the suggested limit of 100000 and could cause high memory usage. Consider not using high-cardinality values like unique IDs as metric tags or, if you need them in the URL, use the name metric tag or URL grouping. See https://grafana.com/docs/k6/latest/using-k6/tags-and-groups/ for details." component=metrics-engine-ingester

running (0m21.0s), 30/30 VUs, 100522 complete and 0 interrupted iterations
rank_ab   [  35% ] 30 VUs  0m21.0s/1m0s

running (0m22.0s), 30/30 VUs, 107737 complete and 0 interrupted iterations
rank_ab   [  37% ] 30 VUs  0m22.0s/1m0s

running (0m23.0s), 30/30 VUs, 115069 complete and 0 interrupted iterations
rank_ab   [  38% ] 30 VUs  0m23.0s/1m0s

running (0m24.0s), 30/30 VUs, 123802 complete and 0 interrupted iterations
rank_ab   [  40% ] 30 VUs  0m24.0s/1m0s

running (0m25.0s), 30/30 VUs, 127484 complete and 0 interrupted iterations
rank_ab   [  42% ] 30 VUs  0m25.0s/1m0s

running (0m26.0s), 30/30 VUs, 131545 complete and 0 interrupted iterations
rank_ab   [  43% ] 30 VUs  0m26.0s/1m0s

running (0m27.0s), 30/30 VUs, 136347 complete and 0 interrupted iterations
rank_ab   [  45% ] 30 VUs  0m27.0s/1m0s

running (0m28.0s), 30/30 VUs, 144193 complete and 0 interrupted iterations
rank_ab   [  47% ] 30 VUs  0m28.0s/1m0s

running (0m29.0s), 30/30 VUs, 151716 complete and 0 interrupted iterations
rank_ab   [  48% ] 30 VUs  0m29.0s/1m0s

running (0m30.0s), 30/30 VUs, 159062 complete and 0 interrupted iterations
rank_ab   [  50% ] 30 VUs  0m30.0s/1m0s

running (0m31.0s), 30/30 VUs, 168012 complete and 0 interrupted iterations
rank_ab   [  52% ] 30 VUs  0m31.0s/1m0s

running (0m32.0s), 30/30 VUs, 175857 complete and 0 interrupted iterations
rank_ab   [  53% ] 30 VUs  0m32.0s/1m0s

running (0m33.0s), 30/30 VUs, 184241 complete and 0 interrupted iterations
rank_ab   [  55% ] 30 VUs  0m33.0s/1m0s

running (0m34.0s), 30/30 VUs, 194094 complete and 0 interrupted iterations
rank_ab   [  57% ] 30 VUs  0m34.0s/1m0s

running (0m35.0s), 30/30 VUs, 201877 complete and 0 interrupted iterations
rank_ab   [  58% ] 30 VUs  0m35.0s/1m0s

running (0m36.0s), 30/30 VUs, 209485 complete and 0 interrupted iterations
rank_ab   [  60% ] 30 VUs  0m36.0s/1m0s

running (0m37.0s), 30/30 VUs, 216569 complete and 0 interrupted iterations
rank_ab   [  62% ] 30 VUs  0m37.0s/1m0s

running (0m38.0s), 30/30 VUs, 224604 complete and 0 interrupted iterations
rank_ab   [  63% ] 30 VUs  0m38.0s/1m0s

running (0m39.0s), 30/30 VUs, 233765 complete and 0 interrupted iterations
rank_ab   [  65% ] 30 VUs  0m39.0s/1m0s

running (0m40.0s), 30/30 VUs, 240853 complete and 0 interrupted iterations
rank_ab   [  67% ] 30 VUs  0m40.0s/1m0s

running (0m41.0s), 30/30 VUs, 250947 complete and 0 interrupted iterations
rank_ab   [  68% ] 30 VUs  0m41.0s/1m0s

running (0m42.0s), 30/30 VUs, 256715 complete and 0 interrupted iterations
rank_ab   [  70% ] 30 VUs  0m42.0s/1m0s

running (0m43.0s), 30/30 VUs, 267400 complete and 0 interrupted iterations
rank_ab   [  72% ] 30 VUs  0m43.0s/1m0s

running (0m44.0s), 30/30 VUs, 273950 complete and 0 interrupted iterations
rank_ab   [  73% ] 30 VUs  0m44.0s/1m0s

running (0m45.0s), 30/30 VUs, 283465 complete and 0 interrupted iterations
rank_ab   [  75% ] 30 VUs  0m45.0s/1m0s

running (0m46.0s), 30/30 VUs, 290322 complete and 0 interrupted iterations
rank_ab   [  77% ] 30 VUs  0m46.0s/1m0s

running (0m47.0s), 30/30 VUs, 299708 complete and 0 interrupted iterations
rank_ab   [  78% ] 30 VUs  0m47.0s/1m0s

running (0m48.0s), 30/30 VUs, 309472 complete and 0 interrupted iterations
rank_ab   [  80% ] 30 VUs  0m48.0s/1m0s

running (0m49.0s), 30/30 VUs, 321074 complete and 0 interrupted iterations
rank_ab   [  82% ] 30 VUs  0m49.0s/1m0s

running (0m50.0s), 30/30 VUs, 331133 complete and 0 interrupted iterations
rank_ab   [  83% ] 30 VUs  0m50.0s/1m0s

running (0m51.0s), 30/30 VUs, 342194 complete and 0 interrupted iterations
rank_ab   [  85% ] 30 VUs  0m51.0s/1m0s

running (0m52.0s), 30/30 VUs, 350552 complete and 0 interrupted iterations
rank_ab   [  87% ] 30 VUs  0m52.0s/1m0s

running (0m53.0s), 30/30 VUs, 363124 complete and 0 interrupted iterations
rank_ab   [  88% ] 30 VUs  0m53.0s/1m0s
time="2026-08-01T21:45:02+09:00" level=warning msg="The test has generated metrics with 400087 unique time series, which is higher than the suggested limit of 100000 and could cause high memory usage. Consider not using high-cardinality values like unique IDs as metric tags or, if you need them in the URL, use the name metric tag or URL grouping. See https://grafana.com/docs/k6/latest/using-k6/tags-and-groups/ for details." component=metrics-engine-ingester

running (0m54.0s), 30/30 VUs, 373622 complete and 0 interrupted iterations
rank_ab   [  90% ] 30 VUs  0m54.0s/1m0s

running (0m55.0s), 30/30 VUs, 386664 complete and 0 interrupted iterations
rank_ab   [  92% ] 30 VUs  0m55.0s/1m0s

running (0m56.0s), 30/30 VUs, 396000 complete and 0 interrupted iterations
rank_ab   [  93% ] 30 VUs  0m56.0s/1m0s

running (0m57.0s), 30/30 VUs, 408860 complete and 0 interrupted iterations
rank_ab   [  95% ] 30 VUs  0m57.0s/1m0s

running (0m58.0s), 30/30 VUs, 418487 complete and 0 interrupted iterations
rank_ab   [  97% ] 30 VUs  0m58.0s/1m0s

running (0m59.0s), 30/30 VUs, 431591 complete and 0 interrupted iterations
rank_ab   [  98% ] 30 VUs  0m59.0s/1m0s

running (1m00.0s), 30/30 VUs, 440261 complete and 0 interrupted iterations
rank_ab   [ 100% ] 30 VUs  1m00.0s/1m0s


  █ TOTAL RESULTS 

    checks_total.......: 440355  7338.899568/s
    checks_succeeded...: 100.00% 440355 out of 440355
    checks_failed......: 0.00%   0 out of 440355

    ✓ top30 200
    ✓ user_rank 200

    CUSTOM
    top30_latency..................: avg=3.38ms min=459µs    med=2.42ms max=199.27ms p(90)=5.41ms p(95)=7.41ms 
    user_rank_latency..............: avg=5.16ms min=939µs    med=3.72ms max=196.38ms p(90)=8.27ms p(95)=11.46ms

    HTTP
    http_req_duration..............: avg=3.91ms min=459µs    med=2.79ms max=199.27ms p(90)=6.39ms p(95)=8.85ms 
      { expected_response:true }...: avg=3.91ms min=459µs    med=2.79ms max=199.27ms p(90)=6.39ms p(95)=8.85ms 
    http_req_failed................: 0.00%  0 out of 440355
    http_reqs......................: 440355 7338.899568/s

    EXECUTION
    iteration_duration.............: avg=4.07ms min=565.29µs med=2.91ms max=260.23ms p(90)=6.62ms p(95)=9.13ms 
    iterations.....................: 440355 7338.899568/s
    vus............................: 30     min=30          max=30
    vus_max........................: 30     min=30          max=30

    NETWORK
    data_received..................: 551 MB 9.2 MB/s
    data_sent......................: 35 MB  584 kB/s



running (1m00.0s), 00/30 VUs, 440355 complete and 0 interrupted iterations
rank_ab ✓ [ 100% ] 30 VUs  1m0s